Revit 2024 API
BRepBuilder.GetResult Method
 Get the Geometry object built by this BRepBuilder. This will clear the built Geometry stored in the BRepBuilder. This function will throw if this BRepBuilder hasn't completed building the b-rep. Use IsResultAvailable() to verify that this BRepBuilder contains a valid result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public Solid GetResult()
Visual Basic
Public Function GetResult As Solid
Visual C++
public:
Solid^ GetResult()
Return Value
 The Geometry object built by this BRepBuilder.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This BRepBuilder object hasn't completed building data or was unsuccessful building it. Built Geometry is unavailable. In order to access the built Geometry, Finish() must be called first. That will set the state to completed.
See Also
BRepBuilder Class
GetResult Overload
Autodesk.Revit.DB Namespace